export const REGISTERATION_SCREENS = [
  { order: 1, prev: "", current: "roles_screen", next: "personal_info_screen" },
  { order: 2, prev: "roles_screen", current: "personal_info_screen", next: "work_info_screen" },
  {
    order: 3,
    prev: "personal_info_screen",
    current: "work_info_screen",
    next: "thank_you_screen",
  },
  { order: 4, prev: "work_info_screen", current: "thank_you_screen", next: "" },
];

export const RolesList = [
  {
    id: 1,
    name: "ui",
  },
  {
    id: 2,
    name: "SWE",
  },
  {
    id: 3,
    name: "PM",
  },
  {
    id: 4,
    name: "AI",
  },
];

export const participant_data = {
  role: 0,
  name: {
    en: {
      first: "",
      middle: "",
      last: "",
    },
    ar: {
      first: "",
      middle: "",
      last: "",
    },
  },
  contact: {
    email: "",
    phone_number: "",
  },
  national_id: "",
  education: {
    university: "",
    College: "",
    major: "",
    expected_graduation_year: 2024,
    gpa: {
      scale: 5,
      cumlative: 5,
    },
  },
  links: {
    github: "",
    linkedin: "",
  },
};


export const EVENT_GOALS = [
  {
    id:1,
    title:"التمكين",
    description:"بعد إتمام مرحلة تطوير المنتجات، يحصل الفائزون والمشاركون المتميزون على فرص تمكين حقيقية، من خلال ربطهم بحاضنات ومسرعات الأعمال وخبراء في المجال لمساعدتهم في تحويل أفكارهم إلى مشاريع واقعية."
  },
  {
    id:2,
    title:"تطوير المنتجات",
    description:"تتيح هذه المرحلة للمشاركين تطبيق ما تعلموه عمليًا عبر حل تحديات تقنية مبتكرة والتعاون مع طلاب من مختلف المسارات الأخرى لمحاكاة المشاريع الواقعية. نمط المرحلة الثانية مدمج مابين الحضور في الرياض والجلسات الافتراضية لمدة أسبوعين."
  },
  {
    id:3,
    title:"التدريب والتعليم",
    description:"تهدف المرحلة الأولى إلى بناء قاعدة تقنية متينة وتطوير المهارات التقنية لدى المشاركين ضمن مسارات الذكاء الاصطناعي، هندسة البرمجيات، إدارة المنتجات التقنية وتصميم واجهات وتجربة المستخدم عبر دمج التعلّم بالتطبيق العملي على مدار ثلاثة أسابيع  عبر محاضرات افتراضية مباشرة وغير مباشرة، مما يتيح للمشاركين التعلم بشكل مرن."
  }
]

export const EVENT_PATHS = [
  {
    id:1,
    title:"مسار إدارة المنتجات"
  },
  {
    id:2,
    title:"مسار تجربة المستخدم وتطوير الواجهات"
  },
  {
    id:3,
    title:"مسار هندسة البرمجيات "
  },
  {
    id:4,
    title:"مسار الذكاء الاصطناعي"
  },
]

export const PATH_DETAILS_CONTENT = [
  {
    id:1,
    title:"مسار إدارة المنتجات",
    sub_title:"يُقدم هذا المسار تدريباً في قيادة تطوير المنتجات، تحديد الأولويات، واستراتيجيات السوق",
    description:"سارة البيز متخصصة في إدارة المنتجات بشركة مزن، بخبرة واسعة في تطوير استراتيجيات المنتجات وإطلاقها بنجاح في السوق مع التركيز على قطاع التقنية المالية والبنية التحتية. خريجة هندسة برمجيات من جامعة الأمير سلطان وحاصلة على وسام قمم للقادة الواعدين، وتتمتع بمهارات متميزة في إدارة العمليات وتطوير المنتجات المبتكرة. عملت سارة مع العديد من الشركات الناشئة بمراحل مختلفة، مما ساعدها على اكتساب معرفة عميقة بكيفية تحقيق النجاح في الأسواق التنافسية. ستقود مسار إدارة المنتجات في برنامج مسار، موجهة المشاركين نحو تطبيق أفضل الممارسات في تطوير وإدارة المنتجات."
 ,"speaker":"سارة البيز",
 "image":"./imgs/speakers/sara.png"
  },
  {
    id:2,
    title:"مسار تجربة المستخدم وتطوير الواجهات",
    sub_title:"يُعلّم هذا المسار مبادئ التصميم المتمحور حول المستخدم وكيفية إنشاء واجهات سهلة الاستخدام.",
    description:"زياد الرويشد متخصص في تصميم تجربة المستخدم، حاصل على بكالوريوس هندسة البرمجيات من جامعة الملك سعود. زياد هو مؤسس \"ستوديو وصلة\" لخدمات التصميم، ويمتلك شهادة احترافية من Nielsen Norman Group في تصميم تجربة المستخدم (UX Master Certificate). يتمتع بفهم عميق لاحتياجات المستخدم وتحويلها إلى حلول فعالة وسهلة الاستخدام. عمل مع شركات متنوعة مما مكنه من تحسين واجهات المستخدم وفق أفضل الممارسات. كما عمل كمقيم نضج تجربة المستخدم مع هيئة الحكومة الرقمية السعودية."
   ,"speaker":"زياد الرويشد",
 "image":"./imgs/speakers/zeyad.svg"
  },
  {
    id:3,
    title:"مسار هندسة البرمجيات ",
    sub_title:"يُساعد هذا المسار المشاركين على الانتقال من مشاريع هندسة البرمجيات التعليمة  إلى حل المشكلات الواقعية وتطبيق أفضل الممارسات أثناء تطوير الحلول لضمان نجاح الأنظمة.",
    description:"يعرب المصطفى هو مهندس برمجيات متخصص في تطوير الحلول البرمجية وقيادة فرق التقنية. حاصل على شهادة البكالوريوس في هندسة البرمجيات من جامعة الملك فهد للبترول والمعادن، وشهادة AWS Developer Associate. يعمل حاليًا كمهندس برمجيات في شركة ثمانية، ويشغل منصب المدير التقني (CTO) في شركة \"إيفنتفل\". يعرب يمتلك خبرة غنية في مجال DevOps، حيث شغل مناصب سابقة كمهندس DevOps في شركة مرسول. يتميز بخبرته في تطوير التطبيقات البرمجية باستخدام Amazon Web Services (AWS) وNestJS، مع سجل حافل في تطوير التطبيقات لنظام iOS والعمل كمهندس برمجيات (Full stack)."
   ,"speaker":"يعرب المصطفى",
 "image":"./imgs/speakers/yaroob.svg"
  },
  {
    id:4,
    title:"مسار الذكاء الاصطناعي",
    sub_title:"يُساعد هذا المسار المشاركين على الانتقال من مشاريع الذكاء الاصطناعي التعليمية إلى حل التحديات الواقعية من خلال الذكاء الاصطناعي.",
    description:"أحمد غنّام، خبير في الذكاء الاصطناعي وعلم البيانات، حاصل على درجة الماجستير في علم البيانات من جامعة الأميرة سمية. لديه خبرة واسعة في تطوير حلول مبتكرة لتطبيقات الذكاء الاصطناعي بهدف تحسين الأداء. يتمتع أحمد بخبرة متخصصة في معالجة وتحليل البيانات الصوتية والمرئية، بالإضافة إلى معالجة اللغات الطبيعية."
   ,"speaker":"أحمد غنام",
 "image":"./imgs/speakers/ghannam.png"
  }
]






export const HACKATHON_QUESTIONS = [
  {
    id: "1",
    question: "أين ستقام مراحل البرنامج؟",
    answer:
      "المرحلة الأولى تستمر 3 أسابيع وتتم عبر محاضرات افتراضية مباشرة، أما المرحلة الثانية فستكون لمدة أسبوعين يتخللها حضور بعد الايام حضورياً في الرياض يتم تحديدها لاحقا.",
  },
  {
    id: "2",
    question: "من يمكنه المشاركة في الهاكاثون؟",
    answer: "البرنامج يستهدف  المهتمين بأحد المسارات المشاركة في هذا البرنامج.",
  },
  {
    id: "3",
    question: "هل أستطيع المشاركة بأكثر من مسار؟",
    answer:
      "لا, يمكنك الالتحاق بمسار واحد فقط",
  },
  {
    id: "4",
    question: "هل يجب أن أكون متمرسًا في البرمجة؟",
    answer:
      "لا، يمكنك المشاركة إذا كان لديك اهتمام بمجالات التقنية والتطوير، حيث سيتم توفير موارد للتعلم والدعم.",
  },
  {
    id: "5",
    question: "ما هي طبيعة التحديات المقدمة؟",
    answer:
      "التحديات تركز على حل مشكلات تقنية من خلال تطوير حلول مبتكرة في عدة مجالات.",
  },
  {
    id: "6",
    question: "كيف يمكنني التسجيل؟",
    answer:
      "يمكنك التسجيل عبر موقع مسار الالكتروني خلال الفترة الزمنية المحددة.",
  },
  {
    id: "7",
    question: "هل المشاركة مجانية؟",
    answer:
      "نعم، المشاركة في مسار مجانية تماماً.",
  },
  {
    id: "8",
    question: "هل تتم تغطية تكاليف السفر للرياض للمرشحين للمرحلة الثانية؟",
    answer:
      "لا, لا يتكفل فريق مسار بتكاليف السفر والمواصلات",
  },
];


export const HACKATHON_TOC = [
  {
    text: "التسجيل متاح للمهتمين داخل المملكة العربية السعودية.",
    image: "./icons/next.svg",
  },
  {
    text: "يجب على المشارك تعبئة بياناته عبر البوابة الخاصة بالتسجيل؛ ولن يتم النظر في أي طلبات لم يقدم عبر البوابة.",
    image: "./icons/next.svg",
  },
  {
    text: "على للمهتمين أن يقر بصحة كامل البيانات المعطاة والمقدمة في كل مراحل البرنامج.",
    image: "./icons/next.svg",
  },


  {
    text: "جميع للمهتمين التعهد بالالتزام بالشروط والأحكام الخاصة بالبرنامج.",
    image: "./icons/next.svg",
  },
  {
    text: "يحق للمنظمين استبعاد أي طالب بدون إبداء أي أسباب ودون أن يترتب على المنظمين أية التزامات أو تعويض من أي نوع.",
    image: "./icons/next.svg",
  },
  {
    text: "جميع القرارات المتخذة نهائية، وقد يقوم فريق صانع بتعليق أو تأخير أو إلغاء أو تغيير الشروط والأحكام في أي وقت.",
    image: "./icons/next.svg",
  },
  {
    text: "لا تتحمل صانع أي خسائر مادية أو أضرار ناتجة عن المشاركة في المسابقة.",
    image: "./icons/next.svg",
  },
  {
    text: "يلتزم جميع الطلاب بحضور جميع الجلسات وورش العمل الخاصة بالبرنامج، وأي تغيب غير مبرر قد يؤدي إلى استبعادهم من البرنامج.",
    image: "./icons/next.svg",
  },
  {
    text: "يتحمل الطلاب المسؤولية الكاملة عن أي استخدام غير مشروع أو انتهاك لأي حقوق ملكية فكرية أو قانونية تخص مشاريعهم المقدمة في البرنامج.",
    image: "./icons/next.svg",
  },
  {
    text: "يلتزم الطلاب بالحفاظ على سلوك احترافي خلال فترة البرنامج، ويحق للمنظمين اتخاذ أي إجراء تجاه أي تصرف غير لائق أو غير قانوني.",
    image: "./icons/next.svg",
  },
  {
    text: "جميع المشاركات والمشاريع المقدمة في البرنامج تخضع للمراجعة التقنية والقانونية للتأكد من توافقها مع الشروط والأحكام وسياسات البرنامج.",
    image: "./icons/next.svg",
  },
  {
    text: "تحمل المشاركون مسؤولية توفير الأدوات والمعدات اللازمة لتنفيذ مشاريعهم، إذا لم يتم توفيرها من قبل الجهة المنظمة.",
    image: "./icons/next.svg",
  },
  {
    text: "يحق للمنظمين نشر المشاريع النهائية أو المراحل التجريبية منها لأغراض إعلامية أو تسويقية تخص البرنامج دون الحاجة للحصول على موافقة مسبقة من المتسابقين.",
    image: "./icons/next.svg",
  },
  
];

export const EVENT_START_DATE = "10-17-2024"